## Data Storage
This notebook stores the cleaned Flipkart product data into a MySQL database.

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from urllib.parse import quote_plus
import warnings
warnings.filterwarnings('ignore')

print("Libraries imported successfully!")

Libraries imported successfully!

## Load the Cleaned Data

In [2]:
df = pd.read_csv('flipkart_cleaned_products.csv')
print(f"Data loaded successfully!")
print(f"Shape: {df.shape}")
df.head()

Data loaded successfully!
Shape: (827, 5)

,Product Name,Product Category,Price,Rating,Review
0,Apple AirPods Pro (2nd generation) with MagSaf...,AirPods,16990.0,4.6,35792
1,"Apple AirPods 4 Wireless Earbuds, Personalised...",AirPods,10999.0,4.4,2935
2,Apple AirPods(2nd gen) with Charging Case Blue...,AirPods,7999.0,4.5,155779
3,Apple AirPods 4 Wireless Earbuds with Active N...,AirPods,16900.0,4.4,1694
4,Apple AirPods Pro 3 Bluetooth,AirPods,25900.0,4.6,597

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 827 entries, 0 to 826
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Product Name      827 non-null    object
 1   Product Category  827 non-null    object
 2   Price             825 non-null    float64
 3   Rating            827 non-null    float64
 4   Review            827 non-null    int64
dtypes: float64(2), int64(1), object(2)
memory usage: 32.4+ KB

 ## MySQL Database Configuration

In [14]:
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="8181"
)

cursor = conn.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS flipkart")
print("Database created successfully!")

Database created successfully!

## Store Data in MySQL

In [15]:
engine = create_engine("mysql+pymysql://root:8181@localhost/flipkart")

print("SQLAlchemy Connected Successfully")


# Upload dataframe to MySQL
table_name = "flipkart_products"
database = "flipkart"

df.to_sql(table_name, engine, if_exists="replace", index=False)

print(f'Data successfully loaded into table "{table_name}" in database "{database}".')

SQLAlchemy Connected Successfully
Data successfully loaded into table "flipkart_products" in database "flipkart".

##  Verify Data in MySQL

In [16]:
df_check = pd.read_sql("SELECT * FROM flipkart_products LIMIT 10;", con=engine)
print("Data verification - First 10 rows from MySQL:")
df_check

Data verification - First 10 rows from MySQL:

,Product Name,Product Category,Price,Rating,Review
0,Apple AirPods Pro (2nd generation) with MagSaf...,AirPods,16990.0,4.6,35792
1,"Apple AirPods 4 Wireless Earbuds, Personalised...",AirPods,10999.0,4.4,2935
2,Apple AirPods(2nd gen) with Charging Case Blue...,AirPods,7999.0,4.5,155779
3,Apple AirPods 4 Wireless Earbuds with Active N...,AirPods,16900.0,4.4,1694
4,Apple AirPods Pro 3 Bluetooth,AirPods,25900.0,4.6,597
5,Apple AirPods (3rd generation) with Lightning ...,AirPods,10999.0,4.3,1703
6,Apple New AirPods Max Bluetooth,AirPods,59900.0,4.4,571
7,Apple AirPods Pro (2nd generation) Bluetooth,AirPods,24990.0,4.5,24
8,Apple AirPods Pro (2nd generation) with Active...,AirPods,26600.0,4.6,11899
9,Apple Airpods Pro With Wireless Charging Case ...,AirPods,22400.0,4.5,64401

In [17]:

df_count = pd.read_sql("SELECT COUNT(*) as total_products FROM flipkart_products;", con=engine)
print(f"\nTotal products in MySQL database: {df_count['total_products'][0]}")

Total products in MySQL database: 827

In [21]:

df_category = pd.read_sql("""
    SELECT `Product Category`, COUNT(*) as count 
    FROM flipkart_products 
    GROUP BY `Product Category`
    ORDER BY count DESC;
""", con=engine)
print("\nProducts by Category in MySQL:")
df_category

Products by Category in MySQL:

   Product Category  count
0           AirPods    141
1       Air Coolers    132
2    Mixer Grinders    119
3     Smart Watches    110
4           Laptops     85
5          Smart TV     83
6  Washing Machines     81
7     Refrigerators     76

In [22]:
df_avg_price = pd.read_sql("""
    SELECT `Product Category`, 
           ROUND(AVG(Price), 2) as avg_price,
           ROUND(AVG(Rating), 2) as avg_rating
    FROM flipkart_products 
    GROUP BY `Product Category`
    ORDER BY avg_price DESC;
""", con=engine)
print("\nAverage Price and Rating by Category:")
df_avg_price

Average Price and Rating by Category:

   Product Category  avg_price  avg_rating
0           Laptops   51670.29        4.05
1          Smart TV   22896.37        4.18
2     Refrigerators   20018.67        4.28
3  Washing Machines   14517.77        4.28
4       Air Coolers    8180.63        3.94
5     Smart Watches    2421.86        0.00
6           AirPods    1982.89        2.26
7    Mixer Grinders    1945.61        4.03

In [23]:
print("\n" + "=" * 60)
print("MySQL DATA STORAGE COMPLETED SUCCESSFULLY!")
print("=" * 60)
print(f"\nDatabase: {database}")
print(f"Table: flipkart_products")
print(f"Total Records: {df_count['total_products'][0]}")

============================================================
MySQL DATA STORAGE COMPLETED SUCCESSFULLY!
============================================================

Database: flipkart
Table: flipkart_products
Total Records: 827